{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Regulation Inspection"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The goal is to get an understanding on how regulations work. \n",
    "\n",
    "My focus is on WX regulations.\n",
    "According to the document \"CRIDA-Regulations-20160401-20160430.csv\", regulations have the following properties:\n",
    "\n",
    "| dateReference | RegulationStart   | RegulationId | TrafficVolumeSet | ReferenceLocation | ReferenceLocationType | TrafficVolume | RegulationEnd     | RegulationActivity | RegulationCancelTime | RegulationDuration | AiracCycle | RegulationCategory | RegulationReasonCode | RegulationDescription | \n",
    "|---------------|-------------------|--------------|------------------|-------------------|-----------------------|---------------|-------------------|--------------------|----------------------|--------------------|------------|--------------------|----------------------|-----------------------| \n",
    "| 20160401      | 20160401 04:40:00 | EDDFA01      | EDGGFMP1         | EDDF              | AD                    | EDDFAWX       | 20160401 07:20:00 | C                  | 20160401 05:52:57    | 72                 | 411        | T                  | W                    | STRONG WINDS          | \n",
    "| 20160401      | 20160401 06:00:00 | LEBLA01M     | LECBFMP          | LEBL              | AD                    | LEBLARR       | 20160401 13:00:00 | C                  | 20160401 11:41:42    | 341                | 411        | T                  | W                    | CB + STORM            | \n",
    "| 20160401      | 20160401 08:40:00 | LECVN01M     | LECBFMP          | LECBCVN           | AS                    | LECBCVN1      | 20160401 11:20:00 | C                  | 20160401 08:16:03    | -23                | 411        | T                  | C                    |                       | \n",
    "\n",
    "\n",
    "\n",
    "Acc. \"DatAcron Data sources for Flow Management scenarios.pptx\", Traffic Volume is the sector name.\n",
    "\n",
    "These are three typical examples for WX-caused regulations. It is important to note the column \"referenceLocation\" which indicates us that the critical weather, that caused the regulation, is not co-located with the regulated sector. Note also the \"referenceLocationType\", which denotes if the area of interest is an airport or an airspace.\n",
    "\n",
    "The second important column is the \"RegulationCancelTime\", which denotes that a regulation may be cancelled if, for example, the actual weather turns out to be better than expected, or the network resilience is good enough to cope with demand exceeding capacity. The third regulation was even cancelled before it begun, yielding a negative \"regulation time\".\n",
    "\n",
    "\n",
    "\n",
    "With the following data exploration, I hope to pull these important properties of the regulation out of the data store. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from pandas.io.json import json_normalize, read_json\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, XML, RDF\n",
    "\n",
    "#import my connection module which allows to connect to the datAcron rdf store\n",
    "from datacron_connector import TripleStoreConnector\n",
    "\n",
    "ts107 = TripleStoreConnector(0)\n",
    "ts109 = TripleStoreConnector(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's check what kind of regulations are stored in the triple store."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get all airblocks of spain\n",
    "\n",
    "First, I will get all airblocks, together with their airspaces and super-airspaces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 12 ms, sys: 4 ms, total: 16 ms\n",
      "Wall time: 25.9 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bigairspace</th>\n",
       "      <th>airspace</th>\n",
       "      <th>block</th>\n",
       "      <th>wkt</th>\n",
       "      <th>lowerlevel</th>\n",
       "      <th>upperlevel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Airspace_LEABTMA_411</td>\n",
       "      <td>Airspace_LEABTA_411</td>\n",
       "      <td>Airblock_LEABTA_249LE</td>\n",
       "      <td>POLYGON ((-2.99166666666667 39, -2.99166666666...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7467.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEABTA_411</td>\n",
       "      <td>Airblock_LEABTA_249LE</td>\n",
       "      <td>POLYGON ((-2.99166666666667 39, -2.99166666666...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7467.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_650LE</td>\n",
       "      <td>POLYGON ((-2.84083333333333 36.4166666666667, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_650LE</td>\n",
       "      <td>POLYGON ((-2.84083333333333 36.4166666666667, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_651LE</td>\n",
       "      <td>POLYGON ((-1.83333333333333 36.85, -1.83333333...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_651LE</td>\n",
       "      <td>POLYGON ((-1.83333333333333 36.85, -1.83333333...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_652LE</td>\n",
       "      <td>POLYGON ((-1.86111111111111 36.7138888888889, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_652LE</td>\n",
       "      <td>POLYGON ((-1.86111111111111 36.7138888888889, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_653LE</td>\n",
       "      <td>POLYGON ((-1.92361111111111 36.4530555555556, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_653LE</td>\n",
       "      <td>POLYGON ((-1.92361111111111 36.4530555555556, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            bigairspace             airspace                  block  \\\n",
       "0  Airspace_LEABTMA_411  Airspace_LEABTA_411  Airblock_LEABTA_249LE   \n",
       "1    Airspace_LETOT_411  Airspace_LEABTA_411  Airblock_LEABTA_249LE   \n",
       "2  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_650LE   \n",
       "3    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_650LE   \n",
       "4  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_651LE   \n",
       "5    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_651LE   \n",
       "6  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_652LE   \n",
       "7    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_652LE   \n",
       "9    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_653LE   \n",
       "8  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_653LE   \n",
       "\n",
       "                                                 wkt lowerlevel upperlevel  \n",
       "0  POLYGON ((-2.99166666666667 39, -2.99166666666...        0.0     7467.6  \n",
       "1  POLYGON ((-2.99166666666667 39, -2.99166666666...        0.0     7467.6  \n",
       "2  POLYGON ((-2.84083333333333 36.4166666666667, ...        0.0     4419.6  \n",
       "3  POLYGON ((-2.84083333333333 36.4166666666667, ...        0.0     4419.6  \n",
       "4  POLYGON ((-1.83333333333333 36.85, -1.83333333...        0.0     4419.6  \n",
       "5  POLYGON ((-1.83333333333333 36.85, -1.83333333...        0.0     4419.6  \n",
       "6  POLYGON ((-1.86111111111111 36.7138888888889, ...        0.0     4419.6  \n",
       "7  POLYGON ((-1.86111111111111 36.7138888888889, ...        0.0     4419.6  \n",
       "9  POLYGON ((-1.92361111111111 36.4530555555556, ...        0.0     4419.6  \n",
       "8  POLYGON ((-1.92361111111111 36.4530555555556, ...        0.0     4419.6  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT  ?bigairspace ?airspace ?block ?wkt ?lowerlevel ?upperlevel\n",
    "WHERE { \n",
    "   \n",
    "   ?airspace dul:hasPart       ?block .\n",
    "   ?block       :hasLowerLevel ?lowerlevel ;\n",
    "                :hasUpperLevel ?upperlevel ;\n",
    "                :hasGeometry   ?geom.\n",
    "   ?geom        :hasMBR_WKT  ?wkt .\n",
    "   \n",
    "   OPTIONAL {?bigairspace dul:hasPart ?airspace. \n",
    "             #?conf           :configurationOfAirspace ?bigairspace ;\n",
    "             #             dul:hasConstituent          ?t.\n",
    "             #?t :TimeStart ?start ;\n",
    "             #   :TimeEnd ?end.\n",
    "             }.\n",
    "   \n",
    "   FILTER regex(str(?block), 'Airblock_LE', \"i\")\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df2 = ts109.query(qry)\n",
    "df2 = ts109.clean(df2)\n",
    "%time df2 = df2.sort_values('block')\n",
    "\n",
    "df2.to_csv('data/allspanishairblocks.csv')\n",
    "df2.head(10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "POLYGON ((-2.99166666666667 39, -2.99166666666667 39.4055555555556, -1.39444444444444 39.4055555555556, -1.39444444444444 39, -2.99166666666667 39))\n"
     ]
    }
   ],
   "source": [
    "print(df2.iloc[0]['wkt'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>lowerlevel</th>\n",
       "      <th>upperlevel</th>\n",
       "      <th>s</th>\n",
       "      <th>actualGeom</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>7467.6</td>\n",
       "      <td>http://83.212.239.107/geometries/airblocks/249LE</td>\n",
       "      <td>POLYGON ((-1.7525 39.4055555555556, -1.3944444...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  lowerlevel upperlevel                                                 s  \\\n",
       "0        0.0     7467.6  http://83.212.239.107/geometries/airblocks/249LE   \n",
       "\n",
       "                                          actualGeom  \n",
       "0  POLYGON ((-1.7525 39.4055555555556, -1.3944444...  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT  ?lowerlevel ?upperlevel ?s (myfn:getGeom(?s) as ?actualGeom)\n",
    "WHERE { :Airblock_LEABTA_249LE :hasLowerLevel ?lowerlevel ;\n",
    "                :hasUpperLevel ?upperlevel ;\n",
    "                :hasGeometry   ?s.\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df3 = ts109.query(qry)\n",
    "df3 = ts109.clean(df3)\n",
    "\n",
    "df3.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'POLYGON ((-1.7525 39.4055555555556, -1.39444444444444 39, -1.48277777777778 39, -2.915 39, -2.99166666666667 39, -2.98333333333333 39.0666666666667, -2.9 39.2, -2.75 39.2666666666667, -1.7525 39.4055555555556))'"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df3.iloc[0]['actualGeom']"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get all information about the three regulations above\n",
    "\n",
    "First, I will check what kind of regulations are available and then, I will check what information is available on the three regulations from the example in the introduction."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "ename": "URLError",
     "evalue": "<urlopen error [Errno 110] Connection timed out>",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTimeoutError\u001b[0m                              Traceback (most recent call last)",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mdo_open\u001b[0;34m(self, http_class, req, **http_conn_args)\u001b[0m\n\u001b[1;32m   1317\u001b[0m                 h.request(req.get_method(), req.selector, req.data, headers,\n\u001b[0;32m-> 1318\u001b[0;31m                           encode_chunked=req.has_header('Transfer-encoding'))\n\u001b[0m\u001b[1;32m   1319\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mOSError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;31m# timeout error\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36mrequest\u001b[0;34m(self, method, url, body, headers, encode_chunked)\u001b[0m\n\u001b[1;32m   1238\u001b[0m         \u001b[0;34m\"\"\"Send a complete request to the server.\"\"\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1239\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_send_request\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmethod\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mheaders\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1240\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36m_send_request\u001b[0;34m(self, method, url, body, headers, encode_chunked)\u001b[0m\n\u001b[1;32m   1284\u001b[0m             \u001b[0mbody\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_encode\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'body'\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1285\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mendheaders\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mbody\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1286\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36mendheaders\u001b[0;34m(self, message_body, encode_chunked)\u001b[0m\n\u001b[1;32m   1233\u001b[0m             \u001b[0;32mraise\u001b[0m \u001b[0mCannotSendHeader\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1234\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_send_output\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmessage_body\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mencode_chunked\u001b[0m\u001b[0;34m=\u001b[0m\u001b[0mencode_chunked\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1235\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36m_send_output\u001b[0;34m(self, message_body, encode_chunked)\u001b[0m\n\u001b[1;32m   1025\u001b[0m         \u001b[0;32mdel\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_buffer\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1026\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mmsg\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1027\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36msend\u001b[0;34m(self, data)\u001b[0m\n\u001b[1;32m    963\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mauto_open\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 964\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    965\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/http/client.py\u001b[0m in \u001b[0;36mconnect\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    935\u001b[0m         self.sock = self._create_connection(\n\u001b[0;32m--> 936\u001b[0;31m             (self.host,self.port), self.timeout, self.source_address)\n\u001b[0m\u001b[1;32m    937\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msetsockopt\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msocket\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mIPPROTO_TCP\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msocket\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mTCP_NODELAY\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m1\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/socket.py\u001b[0m in \u001b[0;36mcreate_connection\u001b[0;34m(address, timeout, source_address)\u001b[0m\n\u001b[1;32m    721\u001b[0m     \u001b[0;32mif\u001b[0m \u001b[0merr\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 722\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    723\u001b[0m     \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/socket.py\u001b[0m in \u001b[0;36mcreate_connection\u001b[0;34m(address, timeout, source_address)\u001b[0m\n\u001b[1;32m    712\u001b[0m                 \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mbind\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msource_address\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 713\u001b[0;31m             \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconnect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msa\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    714\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0msock\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mTimeoutError\u001b[0m: [Errno 110] Connection timed out",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mURLError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-2-3d8aeba18e51>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     10\u001b[0m  \u001b[0;31m#?s rdf:type/rdfs:subClassOf* :SpatiotemporalRegion\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     11\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 12\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqry\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     13\u001b[0m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclean\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     14\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhead\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m10\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/jsnotes/1_datAcron/datacron_connector.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self, query)\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     47\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 48\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     49\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     50\u001b[0m         \u001b[0;31m#clean up the column mess (thanks to David Knodt)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    599\u001b[0m             \u001b[0;34m@\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mL\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;34m}\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    600\u001b[0m         \"\"\"\n\u001b[0;32m--> 601\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    602\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    603\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    569\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    570\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 571\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    572\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    573\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0murllib\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0merror\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mHTTPError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    221\u001b[0m     \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    222\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 223\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    224\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    225\u001b[0m \u001b[0;32mdef\u001b[0m \u001b[0minstall_opener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mopener\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    524\u001b[0m             \u001b[0mreq\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    525\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 526\u001b[0;31m         \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    527\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    528\u001b[0m         \u001b[0;31m# post-process response\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36m_open\u001b[0;34m(self, req, data)\u001b[0m\n\u001b[1;32m    542\u001b[0m         \u001b[0mprotocol\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mtype\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    543\u001b[0m         result = self._call_chain(self.handle_open, protocol, protocol +\n\u001b[0;32m--> 544\u001b[0;31m                                   '_open', req)\n\u001b[0m\u001b[1;32m    545\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    546\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    502\u001b[0m         \u001b[0;32mfor\u001b[0m \u001b[0mhandler\u001b[0m \u001b[0;32min\u001b[0m \u001b[0mhandlers\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    503\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 504\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    505\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    506\u001b[0m                 \u001b[0;32mreturn\u001b[0m \u001b[0mresult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_open\u001b[0;34m(self, req)\u001b[0m\n\u001b[1;32m   1344\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1345\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1346\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdo_open\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhttp\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclient\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mHTTPConnection\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1347\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1348\u001b[0m     \u001b[0mhttp_request\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mAbstractHTTPHandler\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdo_request_\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mdo_open\u001b[0;34m(self, http_class, req, **http_conn_args)\u001b[0m\n\u001b[1;32m   1318\u001b[0m                           encode_chunked=req.has_header('Transfer-encoding'))\n\u001b[1;32m   1319\u001b[0m             \u001b[0;32mexcept\u001b[0m \u001b[0mOSError\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merr\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0;31m# timeout error\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m-> 1320\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mURLError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0merr\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m   1321\u001b[0m             \u001b[0mr\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mh\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mgetresponse\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m   1322\u001b[0m         \u001b[0;32mexcept\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mURLError\u001b[0m: <urlopen error [Errno 110] Connection timed out>"
     ]
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?s\n",
    "WHERE {\n",
    "  ?s rdfs:subClassOf* :FM_Regulation .\n",
    "}\n",
    "\"\"\"\n",
    " #?s rdf:type/rdfs:subClassOf* :SpatiotemporalRegion \n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(10)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What properties are available for the WX regulations? I hope to see some of the columns listed in the introduction."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>hasRegion</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>hasTimeInterval</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>RegulationAiracCycle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>RegulationDescription</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hasReferenceLocation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       p\n",
       "0                   type\n",
       "1              hasRegion\n",
       "2        hasTimeInterval\n",
       "3   RegulationAiracCycle\n",
       "4  RegulationDescription\n",
       "5   hasReferenceLocation"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT DISTINCT ?p\n",
    "WHERE {\n",
    "  ?s a :ATC_WeatherRegulation ; \n",
    "     ?p ?o .\n",
    "}\n",
    "\"\"\"\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEM\n",
    "\n",
    "It seems that at least the \n",
    "\n",
    " - reference location\n",
    " - reference location type\n",
    " - and the cancellation time \n",
    " \n",
    "are not available. Maybe hidden somewhere? I will inspect further. In the next query, I inspect all properties of the three regulations cited above."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>trafficVolume</th>\n",
       "      <th>refLoc</th>\n",
       "      <th>description</th>\n",
       "      <th>time</th>\n",
       "      <th>stype</th>\n",
       "      <th>start</th>\n",
       "      <th>end</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>EDDFA01_411</td>\n",
       "      <td>Airspace_EDDF_411</td>\n",
       "      <td>Place_Frankfurt_Main_Airport</td>\n",
       "      <td>STRONG WINDS_</td>\n",
       "      <td>intv_1459485600000_1459495200000</td>\n",
       "      <td>ATC_WeatherRegulation</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "      <td>2016-04-01T05:52:57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Airspace_LEBL_411</td>\n",
       "      <td>Place_Barcelona_El_Prat_Airport</td>\n",
       "      <td>CB + STORM_</td>\n",
       "      <td>intv_1459490400000_1459515600000</td>\n",
       "      <td>ATC_WeatherRegulation</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T11:41:42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>LECVN01M_411</td>\n",
       "      <td>Airspace_LECBCVN_411</td>\n",
       "      <td>Airspace_LECBCVN_411</td>\n",
       "      <td>_</td>\n",
       "      <td>intv_1459500000000_1459509600000</td>\n",
       "      <td>ATC_Capacity</td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>2016-04-01T08:16:03</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              s         trafficVolume                           refLoc  \\\n",
       "0   EDDFA01_411     Airspace_EDDF_411     Place_Frankfurt_Main_Airport   \n",
       "1  LEBLA01M_411     Airspace_LEBL_411  Place_Barcelona_El_Prat_Airport   \n",
       "2  LECVN01M_411  Airspace_LECBCVN_411             Airspace_LECBCVN_411   \n",
       "\n",
       "     description                              time                  stype  \\\n",
       "0  STRONG WINDS_  intv_1459485600000_1459495200000  ATC_WeatherRegulation   \n",
       "1    CB + STORM_  intv_1459490400000_1459515600000  ATC_WeatherRegulation   \n",
       "2              _  intv_1459500000000_1459509600000           ATC_Capacity   \n",
       "\n",
       "                 start                  end  \n",
       "0  2016-04-01T04:40:00  2016-04-01T05:52:57  \n",
       "1  2016-04-01T06:00:00  2016-04-01T11:41:42  \n",
       "2  2016-04-01T08:40:00  2016-04-01T08:16:03  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "  VALUES ?s {:EDDFA01_411 :LEBLA01M_411 :LECVN01M_411} \n",
    "  ?s dul:hasRegion             ?trafficVolume ;\n",
    "        :hasReferenceLocation ?refLoc ;\n",
    " :RegulationDescription ?description ;\n",
    "    dul:hasTimeInterval       ?time  ;\n",
    "        a                     ?stype.\n",
    "\n",
    " ?time :TimeStart ?start ;\n",
    "       :TimeEnd   ?end .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "reguls = ts109.query(qry)\n",
    "reguls = ts109.clean(reguls)\n",
    "reguls.to_csv('data/regulations.csv')\n",
    "reguls.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "      <td>FM_Airspace</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECBPP2_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMDGU_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMTLU_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMPAU_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCAAC_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMDGL_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECBP1U_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECBLVU_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRNE_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMASU_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_LECMZGZ_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCOCE_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRCE_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRCW_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRNW_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRST_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCRWW_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCACW_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>hasPart</td>\n",
       "      <td>Airspace_GCCCFCN_411</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "          p                     o\n",
       "0      type           FM_Airspace\n",
       "1   hasPart  Airspace_LECBPP2_411\n",
       "2   hasPart  Airspace_LECMDGU_411\n",
       "3   hasPart  Airspace_LECMTLU_411\n",
       "4   hasPart  Airspace_LECMPAU_411\n",
       "5   hasPart  Airspace_GCCCAAC_411\n",
       "6   hasPart  Airspace_LECMDGL_411\n",
       "7   hasPart  Airspace_LECBP1U_411\n",
       "8   hasPart  Airspace_LECBLVU_411\n",
       "9   hasPart  Airspace_GCCCRNE_411\n",
       "10  hasPart  Airspace_LECMASU_411\n",
       "11  hasPart  Airspace_LECMZGZ_411\n",
       "12  hasPart  Airspace_GCCCOCE_411\n",
       "13  hasPart  Airspace_GCCCRCE_411\n",
       "14  hasPart  Airspace_GCCCRCW_411\n",
       "15  hasPart  Airspace_GCCCRNW_411\n",
       "16  hasPart  Airspace_GCCCRST_411\n",
       "17  hasPart  Airspace_GCCCRWW_411\n",
       "18  hasPart  Airspace_GCCCACW_411\n",
       "19  hasPart  Airspace_GCCCFCN_411"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT *\n",
    "WHERE {\n",
    "  :Airspace_LETOT_411 ?p ?o\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "space = ts109.query(qry)\n",
    "space = ts109.clean(space)\n",
    "space.head(20)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "UPDATE\n",
    "\n",
    "Good:\n",
    " - The referenceLocation are now encoded. \n",
    " - The 109 yields the required results. The times are correct now.\n",
    " - But still entering the \"sector\" value from the regulations query does not get me any further.\n",
    "\n",
    "To Do:\n",
    " - Somehow, I need to get from regulations to airblocks.\n",
    " - Maybe something wrong with my queries?\n",
    " - Here the answer from Giorgos: Comment 8: \"Getting from regulations to airblocks is currently possible, with the following query:\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>regulation</th>\n",
       "      <th>airspace</th>\n",
       "      <th>refloc</th>\n",
       "      <th>WKT</th>\n",
       "      <th>low</th>\n",
       "      <th>high</th>\n",
       "      <th>config</th>\n",
       "      <th>open</th>\n",
       "      <th>close</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-03-31T00:00:00</td>\n",
       "      <td>2016-03-31T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-01T00:00:00</td>\n",
       "      <td>2016-04-01T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-02T00:00:00</td>\n",
       "      <td>2016-04-02T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-03T00:00:00</td>\n",
       "      <td>2016-04-03T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-04T00:00:00</td>\n",
       "      <td>2016-04-04T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-05T00:00:00</td>\n",
       "      <td>2016-04-05T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-06T00:00:00</td>\n",
       "      <td>2016-04-06T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-07T00:00:00</td>\n",
       "      <td>2016-04-07T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-08T00:00:00</td>\n",
       "      <td>2016-04-08T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-09T00:00:00</td>\n",
       "      <td>2016-04-09T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-10T00:00:00</td>\n",
       "      <td>2016-04-10T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-11T00:00:00</td>\n",
       "      <td>2016-04-11T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-12T00:00:00</td>\n",
       "      <td>2016-04-12T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-13T00:00:00</td>\n",
       "      <td>2016-04-13T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-14T00:00:00</td>\n",
       "      <td>2016-04-14T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-15T00:00:00</td>\n",
       "      <td>2016-04-15T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-16T00:00:00</td>\n",
       "      <td>2016-04-16T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-17T00:00:00</td>\n",
       "      <td>2016-04-17T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-18T00:00:00</td>\n",
       "      <td>2016-04-18T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-19T00:00:00</td>\n",
       "      <td>2016-04-19T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-20T00:00:00</td>\n",
       "      <td>2016-04-20T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-21T00:00:00</td>\n",
       "      <td>2016-04-21T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-22T00:00:00</td>\n",
       "      <td>2016-04-22T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-23T00:00:00</td>\n",
       "      <td>2016-04-23T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-24T00:00:00</td>\n",
       "      <td>2016-04-24T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-25T00:00:00</td>\n",
       "      <td>2016-04-25T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-26T00:00:00</td>\n",
       "      <td>2016-04-26T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((5.18638888888889 43.4675, 5.21638888...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-27T00:00:00</td>\n",
       "      <td>2016-04-27T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-03-31T00:00:00</td>\n",
       "      <td>2016-03-31T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-01T00:00:00</td>\n",
       "      <td>2016-04-01T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-02T00:00:00</td>\n",
       "      <td>2016-04-02T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-03T00:00:00</td>\n",
       "      <td>2016-04-03T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-04T00:00:00</td>\n",
       "      <td>2016-04-04T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-05T00:00:00</td>\n",
       "      <td>2016-04-05T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-06T00:00:00</td>\n",
       "      <td>2016-04-06T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-07T00:00:00</td>\n",
       "      <td>2016-04-07T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-08T00:00:00</td>\n",
       "      <td>2016-04-08T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-09T00:00:00</td>\n",
       "      <td>2016-04-09T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-10T00:00:00</td>\n",
       "      <td>2016-04-10T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-11T00:00:00</td>\n",
       "      <td>2016-04-11T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-12T00:00:00</td>\n",
       "      <td>2016-04-12T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-13T00:00:00</td>\n",
       "      <td>2016-04-13T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-14T00:00:00</td>\n",
       "      <td>2016-04-14T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-15T00:00:00</td>\n",
       "      <td>2016-04-15T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-16T00:00:00</td>\n",
       "      <td>2016-04-16T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-17T00:00:00</td>\n",
       "      <td>2016-04-17T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-18T00:00:00</td>\n",
       "      <td>2016-04-18T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-19T00:00:00</td>\n",
       "      <td>2016-04-19T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-20T00:00:00</td>\n",
       "      <td>2016-04-20T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-21T00:00:00</td>\n",
       "      <td>2016-04-21T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-22T00:00:00</td>\n",
       "      <td>2016-04-22T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-23T00:00:00</td>\n",
       "      <td>2016-04-23T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-24T00:00:00</td>\n",
       "      <td>2016-04-24T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-25T00:00:00</td>\n",
       "      <td>2016-04-25T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-26T00:00:00</td>\n",
       "      <td>2016-04-26T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((6.00361111111111 43.3125, 6.025 43.1...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>3505.2000000000003</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-27T00:00:00</td>\n",
       "      <td>2016-04-27T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((4.16055555555556 43.6252777777778, 4...</td>\n",
       "      <td>2895.6000000000004</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-03-31T00:00:00</td>\n",
       "      <td>2016-03-31T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((4.16055555555556 43.6252777777778, 4...</td>\n",
       "      <td>2895.6000000000004</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-01T00:00:00</td>\n",
       "      <td>2016-04-01T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((4.16055555555556 43.6252777777778, 4...</td>\n",
       "      <td>2895.6000000000004</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-02T00:00:00</td>\n",
       "      <td>2016-04-02T23:59:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>LFMLE05E_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>Airspace_LFMLTMA_411</td>\n",
       "      <td>POLYGON ((4.16055555555556 43.6252777777778, 4...</td>\n",
       "      <td>2895.6000000000004</td>\n",
       "      <td>4419.6</td>\n",
       "      <td>AirspaceConfiguration_LFMLTMA_C1A_411</td>\n",
       "      <td>2016-04-03T00:00:00</td>\n",
       "      <td>2016-04-03T23:59:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      regulation              airspace                refloc  \\\n",
       "0   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "1   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "2   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "3   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "4   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "5   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "6   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "7   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "8   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "9   LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "10  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "11  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "12  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "13  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "14  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "15  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "16  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "17  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "18  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "19  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "20  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "21  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "22  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "23  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "24  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "25  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "26  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "27  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "28  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "29  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "30  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "31  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "32  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "33  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "34  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "35  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "36  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "37  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "38  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "39  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "40  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "41  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "42  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "43  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "44  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "45  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "46  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "47  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "48  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "49  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "50  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "51  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "52  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "53  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "54  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "55  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "56  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "57  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "58  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "59  LFMLE05E_411  Airspace_LFMLTMA_411  Airspace_LFMLTMA_411   \n",
       "\n",
       "                                                  WKT                 low  \\\n",
       "0   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "1   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "2   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "3   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "4   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "5   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "6   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "7   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "8   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "9   POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "10  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "11  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "12  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "13  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "14  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "15  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "16  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "17  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "18  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "19  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "20  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "21  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "22  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "23  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "24  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "25  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "26  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "27  POLYGON ((5.18638888888889 43.4675, 5.21638888...                 0.0   \n",
       "28  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "29  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "30  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "31  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "32  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "33  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "34  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "35  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "36  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "37  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "38  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "39  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "40  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "41  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "42  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "43  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "44  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "45  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "46  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "47  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "48  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "49  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "50  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "51  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "52  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "53  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "54  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "55  POLYGON ((6.00361111111111 43.3125, 6.025 43.1...                 0.0   \n",
       "56  POLYGON ((4.16055555555556 43.6252777777778, 4...  2895.6000000000004   \n",
       "57  POLYGON ((4.16055555555556 43.6252777777778, 4...  2895.6000000000004   \n",
       "58  POLYGON ((4.16055555555556 43.6252777777778, 4...  2895.6000000000004   \n",
       "59  POLYGON ((4.16055555555556 43.6252777777778, 4...  2895.6000000000004   \n",
       "\n",
       "                  high                                 config  \\\n",
       "0               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "1               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "2               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "3               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "4               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "5               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "6               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "7               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "8               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "9               4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "10              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "11              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "12              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "13              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "14              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "15              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "16              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "17              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "18              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "19              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "20              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "21              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "22              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "23              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "24              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "25              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "26              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "27              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "28  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "29  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "30  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "31  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "32  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "33  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "34  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "35  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "36  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "37  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "38  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "39  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "40  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "41  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "42  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "43  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "44  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "45  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "46  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "47  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "48  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "49  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "50  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "51  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "52  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "53  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "54  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "55  3505.2000000000003  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "56              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "57              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "58              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "59              4419.6  AirspaceConfiguration_LFMLTMA_C1A_411   \n",
       "\n",
       "                   open                close  \n",
       "0   2016-03-31T00:00:00  2016-03-31T23:59:00  \n",
       "1   2016-04-01T00:00:00  2016-04-01T23:59:00  \n",
       "2   2016-04-02T00:00:00  2016-04-02T23:59:00  \n",
       "3   2016-04-03T00:00:00  2016-04-03T23:59:00  \n",
       "4   2016-04-04T00:00:00  2016-04-04T23:59:00  \n",
       "5   2016-04-05T00:00:00  2016-04-05T23:59:00  \n",
       "6   2016-04-06T00:00:00  2016-04-06T23:59:00  \n",
       "7   2016-04-07T00:00:00  2016-04-07T23:59:00  \n",
       "8   2016-04-08T00:00:00  2016-04-08T23:59:00  \n",
       "9   2016-04-09T00:00:00  2016-04-09T23:59:00  \n",
       "10  2016-04-10T00:00:00  2016-04-10T23:59:00  \n",
       "11  2016-04-11T00:00:00  2016-04-11T23:59:00  \n",
       "12  2016-04-12T00:00:00  2016-04-12T23:59:00  \n",
       "13  2016-04-13T00:00:00  2016-04-13T23:59:00  \n",
       "14  2016-04-14T00:00:00  2016-04-14T23:59:00  \n",
       "15  2016-04-15T00:00:00  2016-04-15T23:59:00  \n",
       "16  2016-04-16T00:00:00  2016-04-16T23:59:00  \n",
       "17  2016-04-17T00:00:00  2016-04-17T23:59:00  \n",
       "18  2016-04-18T00:00:00  2016-04-18T23:59:00  \n",
       "19  2016-04-19T00:00:00  2016-04-19T23:59:00  \n",
       "20  2016-04-20T00:00:00  2016-04-20T23:59:00  \n",
       "21  2016-04-21T00:00:00  2016-04-21T23:59:00  \n",
       "22  2016-04-22T00:00:00  2016-04-22T23:59:00  \n",
       "23  2016-04-23T00:00:00  2016-04-23T23:59:00  \n",
       "24  2016-04-24T00:00:00  2016-04-24T23:59:00  \n",
       "25  2016-04-25T00:00:00  2016-04-25T23:59:00  \n",
       "26  2016-04-26T00:00:00  2016-04-26T23:59:00  \n",
       "27  2016-04-27T00:00:00  2016-04-27T23:59:00  \n",
       "28  2016-03-31T00:00:00  2016-03-31T23:59:00  \n",
       "29  2016-04-01T00:00:00  2016-04-01T23:59:00  \n",
       "30  2016-04-02T00:00:00  2016-04-02T23:59:00  \n",
       "31  2016-04-03T00:00:00  2016-04-03T23:59:00  \n",
       "32  2016-04-04T00:00:00  2016-04-04T23:59:00  \n",
       "33  2016-04-05T00:00:00  2016-04-05T23:59:00  \n",
       "34  2016-04-06T00:00:00  2016-04-06T23:59:00  \n",
       "35  2016-04-07T00:00:00  2016-04-07T23:59:00  \n",
       "36  2016-04-08T00:00:00  2016-04-08T23:59:00  \n",
       "37  2016-04-09T00:00:00  2016-04-09T23:59:00  \n",
       "38  2016-04-10T00:00:00  2016-04-10T23:59:00  \n",
       "39  2016-04-11T00:00:00  2016-04-11T23:59:00  \n",
       "40  2016-04-12T00:00:00  2016-04-12T23:59:00  \n",
       "41  2016-04-13T00:00:00  2016-04-13T23:59:00  \n",
       "42  2016-04-14T00:00:00  2016-04-14T23:59:00  \n",
       "43  2016-04-15T00:00:00  2016-04-15T23:59:00  \n",
       "44  2016-04-16T00:00:00  2016-04-16T23:59:00  \n",
       "45  2016-04-17T00:00:00  2016-04-17T23:59:00  \n",
       "46  2016-04-18T00:00:00  2016-04-18T23:59:00  \n",
       "47  2016-04-19T00:00:00  2016-04-19T23:59:00  \n",
       "48  2016-04-20T00:00:00  2016-04-20T23:59:00  \n",
       "49  2016-04-21T00:00:00  2016-04-21T23:59:00  \n",
       "50  2016-04-22T00:00:00  2016-04-22T23:59:00  \n",
       "51  2016-04-23T00:00:00  2016-04-23T23:59:00  \n",
       "52  2016-04-24T00:00:00  2016-04-24T23:59:00  \n",
       "53  2016-04-25T00:00:00  2016-04-25T23:59:00  \n",
       "54  2016-04-26T00:00:00  2016-04-26T23:59:00  \n",
       "55  2016-04-27T00:00:00  2016-04-27T23:59:00  \n",
       "56  2016-03-31T00:00:00  2016-03-31T23:59:00  \n",
       "57  2016-04-01T00:00:00  2016-04-01T23:59:00  \n",
       "58  2016-04-02T00:00:00  2016-04-02T23:59:00  \n",
       "59  2016-04-03T00:00:00  2016-04-03T23:59:00  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT ?regulation ?airspace ?refloc (myfn:getGeom(?g) as ?WKT) ?low ?high ?config ?open ?close\n",
    "WHERE {\n",
    "  ?regulation      a             ?type .\n",
    "  ?type       rdfs:subClassOf    :FM_Regulation .\n",
    "  ?regulation  dul:hasRegion     ?airspace ;\n",
    "                  :hasReferenceLocation ?refloc ;\n",
    "               dul:hasTimeInterval       ?regtime  .\n",
    "   ?regtime       :TimeStart             ?regstart ;\n",
    "                  :TimeEnd               ?regend .\n",
    "\n",
    "  ?airspace    dul:hasPart       ?s .\n",
    "  ?s           dul:hasPart       ?b .\n",
    "  ?b              :hasGeometry   ?g ;\n",
    "                  :hasLowerLevel ?low ;\n",
    "                  :hasUpperLevel ?high .\n",
    "                  \n",
    "                  \n",
    "   ?config a :FM_Configuration ;\n",
    "             :configurationOfAirspace ?airspace ;\n",
    "          dul:hasConstituent          ?period .\n",
    "   ?period   :TimeStart               ?open ;\n",
    "             :TimeEnd                 ?close.\n",
    "} LIMIT 1000\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "regs_and_spaces = ts109.query(qry)\n",
    "regs_and_spaces = ts109.clean(regs_and_spaces)\n",
    "regs_and_spaces.head(60)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1000"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(regs_and_spaces)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>airspace</th>\n",
       "      <th>refloc</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Airspace_LEBL_411</td>\n",
       "      <td>Place_Barcelona_El_Prat_Airport</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            airspace                           refloc\n",
       "0  Airspace_LEBL_411  Place_Barcelona_El_Prat_Airport"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT ?airspace ?refloc #(myfn:getGeom(?g) as ?WKT) ?low ?high\n",
    "WHERE {\n",
    "  :LEBLA01M_411 dul:hasRegion     ?airspace ;\n",
    "                  :hasReferenceLocation ?refloc.\n",
    " # ?airspace    dul:hasPart       ?s .\n",
    "#  ?s           dul:hasPart       ?b .\n",
    "#  ?b              :hasGeometry   ?g ;\n",
    " #                 :hasLowerLevel ?low ;\n",
    "#                  :hasUpperLevel ?high .\n",
    "} limit 100\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "regs_and_spaces = ts109.query(qry)\n",
    "regs_and_spaces = ts109.clean(regs_and_spaces)\n",
    "regs_and_spaces.head(60)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>regulation</th>\n",
       "      <th>airspace</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [regulation, airspace]\n",
       "Index: []"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT ?regulation ?airspace #(myfn:getGeom(?g) as ?WKT) \n",
    "WHERE {\n",
    "  ?regulation      a             ?type .\n",
    "  ?type       rdfs:subClassOf    :FM_Regulation .\n",
    "  ?regulation  dul:hasRegion     ?airspace .\n",
    "  ?airspace    dul:hasPart*      ?b .\n",
    "  ?b              :hasGeometry   ?g\n",
    "} limit 10\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "regs_and_spaces = ts109.query(qry)\n",
    "regs_and_spaces = ts109.clean(regs_and_spaces)\n",
    "regs_and_spaces.head(20)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Unfortunately, it does not seem to work out!\n",
    "\n",
    "\n",
    "The next query used to misbehave before, but it is now fixed thanks to Giorgos Comment #9"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>sector</th>\n",
       "      <th>time</th>\n",
       "      <th>refloc</th>\n",
       "      <th>description</th>\n",
       "      <th>start</th>\n",
       "      <th>end</th>\n",
       "      <th>duration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>EDDFA01_411</td>\n",
       "      <td>Airspace_EDDF_411</td>\n",
       "      <td>intv_1459485600000_1459495200000</td>\n",
       "      <td>Place_Frankfurt_Main_Airport</td>\n",
       "      <td>STRONG WINDS_</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "      <td>2016-04-01T05:52:57</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Airspace_LEBL_411</td>\n",
       "      <td>intv_1459490400000_1459515600000</td>\n",
       "      <td>Place_Barcelona_El_Prat_Airport</td>\n",
       "      <td>CB + STORM_</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T11:41:42</td>\n",
       "      <td>341</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              s             sector                              time  \\\n",
       "0   EDDFA01_411  Airspace_EDDF_411  intv_1459485600000_1459495200000   \n",
       "1  LEBLA01M_411  Airspace_LEBL_411  intv_1459490400000_1459515600000   \n",
       "\n",
       "                            refloc    description                start  \\\n",
       "0     Place_Frankfurt_Main_Airport  STRONG WINDS_  2016-04-01T04:40:00   \n",
       "1  Place_Barcelona_El_Prat_Airport    CB + STORM_  2016-04-01T06:00:00   \n",
       "\n",
       "                   end duration  \n",
       "0  2016-04-01T05:52:57       72  \n",
       "1  2016-04-01T11:41:42      341  "
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?s ?sector ?time ?refloc ?description ?start ?end ?duration\n",
    "WHERE {\n",
    "  VALUES ?s {:EDDFA01_411 :LEBLA01M_411 :LECVN01M_411 } \n",
    "  ?s dul:hasRegion             ?sector ;\n",
    "        :hasReferenceLocation        ?refloc ;\n",
    "        :RegulationDescription ?description ;\n",
    "     dul:hasTimeInterval       ?time .\n",
    "   \n",
    "   ?time :TimeStart ?start ;\n",
    "        :TimeEnd   ?end ; \n",
    "        :duration ?duration .\n",
    "\n",
    "        \n",
    "}\n",
    "\"\"\" \n",
    "\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "      <td>major_Aerodrome</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>type</td>\n",
       "      <td>AerodromeClassA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>hasGeometry</td>\n",
       "      <td>geom_8.571822869076076_50.05067708952074</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>partOfCountry</td>\n",
       "      <td>Place_Germany</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>elevationOfPlace</td>\n",
       "      <td>110.94720000000001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hasCountryCode</td>\n",
       "      <td>DE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>hasPlaceName</td>\n",
       "      <td>Flughafen Frankfurt m Main, Walldorf, Hesse, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>seeAlso</td>\n",
       "      <td>http://worldaerodata.com/wad.cgi?airport=EDDF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>seeAlso</td>\n",
       "      <td>http://www.airportcity-frankfurt.com/</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>seeAlso</td>\n",
       "      <td>http://en.wikipedia.org/wiki/Frankfurt_Airport</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  p                                                  o\n",
       "0              type                                    major_Aerodrome\n",
       "1              type                                    AerodromeClassA\n",
       "2       hasGeometry           geom_8.571822869076076_50.05067708952074\n",
       "3     partOfCountry                                      Place_Germany\n",
       "4  elevationOfPlace                                 110.94720000000001\n",
       "5    hasCountryCode                                                 DE\n",
       "6      hasPlaceName  Flughafen Frankfurt m Main, Walldorf, Hesse, ...\n",
       "7           seeAlso      http://worldaerodata.com/wad.cgi?airport=EDDF\n",
       "8           seeAlso              http://www.airportcity-frankfurt.com/\n",
       "9           seeAlso     http://en.wikipedia.org/wiki/Frankfurt_Airport"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?p ?o\n",
    "WHERE {\n",
    "  :Place_Frankfurt_Main_Airport ?p ?o\n",
    "\n",
    "        \n",
    "}\n",
    "\"\"\" \n",
    "\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Weather Analysis (related to page 5 of tutorial) \n",
    "\n",
    "I think I will need some help here too!\n",
    "\n",
    "Though we have seen that Sectors and Participants cannot be linked with other objects, I can infer from the semantics of the regulations that the airports EDDF and LEBL and the airspace LECB must have had severe wx at that time. \n",
    "\n",
    "Lets try to pull it out.\n",
    "\n",
    "To my knowledge, the wx is written to the nodes, so I need to find the trajectories which have a spatio-temporal intersection with the wx event at the sector. For this, I begin with the basic intersection query from the tutorial, page 5."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "ename": "EndPointInternalError",
     "evalue": "EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed  \\nWHERE {\\n?s1   a :Node ;\\n        :ofMovingObject ?vessel ;\\n        :hasSpeed ?speed ;\\n     dul:hasConstituent/:TimeStart ?time ;\\n     dul:hasConstituent/:hasWKT ?wkt .\\n\\nFILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\\n}\\n'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mHTTPError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    570\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 571\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    572\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    222\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 223\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    224\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    531\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 532\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    533\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    641\u001b[0m             response = self.parent.error(\n\u001b[0;32m--> 642\u001b[0;31m                 'http', request, response, code, msg, hdrs)\n\u001b[0m\u001b[1;32m    643\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    569\u001b[0m             \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'default'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'http_error_default'\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0morig_args\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 570\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    571\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    503\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 504\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    505\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_default\u001b[0;34m(self, req, fp, code, msg, hdrs)\u001b[0m\n\u001b[1;32m    649\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_error_default\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 650\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mHTTPError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    651\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mHTTPError\u001b[0m: HTTP Error 500: SPARQL Request Failed",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m                     Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-22-4faba6723360>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     18\u001b[0m \"\"\"\n\u001b[1;32m     19\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 20\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqry\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     21\u001b[0m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclean\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     22\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhead\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m20\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/jsnotes/1_datAcron/datacron_connector.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self, query)\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     47\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 48\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     49\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     50\u001b[0m         \u001b[0;31m#clean up the column mess (thanks to David Knodt)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    599\u001b[0m             \u001b[0;34m@\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mL\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;34m}\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    600\u001b[0m         \"\"\"\n\u001b[0;32m--> 601\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    602\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    603\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    577\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointNotFound\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    578\u001b[0m             \u001b[0;32melif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m500\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 579\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointInternalError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    580\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    581\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m: EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed  \\nWHERE {\\n?s1   a :Node ;\\n        :ofMovingObject ?vessel ;\\n        :hasSpeed ?speed ;\\n     dul:hasConstituent/:TimeStart ?time ;\\n     dul:hasConstituent/:hasWKT ?wkt .\\n\\nFILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\\n}\\n'"
     ]
    }
   ],
   "source": [
    "# PREFIX bif: <java:datAcronTester.unipi.gr.sparql_functions.>   <--- only to be used in 109\n",
    "\n",
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?vessel ?time ?wkt ?speed  \n",
    "WHERE {\n",
    "?s1   a :Node ;\n",
    "        :ofMovingObject ?vessel ;\n",
    "        :hasSpeed ?speed ;\n",
    "     dul:hasConstituent/:TimeStart ?time ;\n",
    "     dul:hasConstituent/:hasWKT ?wkt .\n",
    "\n",
    "FILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEMS\n",
    " - I get a timeout on the 107 store\n",
    " - I get zero results on the 109 store\n",
    " - note: on the 107 store, the bif: prefix must not be used, on the 109 store, it must be used. Therefore, you cannot query both stores with the same string atm.\n",
    " \n",
    " \n",
    "Back to EDDF and LEBL and LECB. Our goal is to get some weather for these places at regulation time. \n",
    "\n",
    "As a first step, we get the geometries of the _reference locations_."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>airport</th>\n",
       "      <th>iata</th>\n",
       "      <th>placename</th>\n",
       "      <th>geo</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LEBL</td>\n",
       "      <td>BCN</td>\n",
       "      <td>BARCELONA/EL PRAT</td>\n",
       "      <td>geom_2_0783333778381348_41_29694366455078</td>\n",
       "      <td>POINT (2.0783333778381348 41.29694366455078)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>EDDF</td>\n",
       "      <td>FRA</td>\n",
       "      <td>FRANKFURT MAIN</td>\n",
       "      <td>geom_8_570555686950684_50_03333282470703</td>\n",
       "      <td>POINT (8.570555686950684 50.03333282470703)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  airport iata          placename                                        geo  \\\n",
       "0    LEBL  BCN  BARCELONA/EL PRAT  geom_2_0783333778381348_41_29694366455078   \n",
       "1    EDDF  FRA     FRANKFURT MAIN   geom_8_570555686950684_50_03333282470703   \n",
       "\n",
       "                                              o  \n",
       "0  POINT (2.0783333778381348 41.29694366455078)  \n",
       "1   POINT (8.570555686950684 50.03333282470703)  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT DISTINCT ?airport ?iata ?placename ?geo ?o\n",
    "WHERE {\n",
    "  VALUES ?airport {'EDDF' 'LEBL' 'LECB'}\n",
    "  ?s :hasICAOcode ?airport ;\n",
    "     :hasIATAcode ?iata ;\n",
    "     :hasPlaceName ?placename ;\n",
    "     :hasGeometry ?geo .\n",
    "  ?geo :hasMBR_WKT ?o .\n",
    "     \n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "reflocs_manually = ts107.query(qry)\n",
    "reflocs_manually = ts107.clean(reflocs_manually)\n",
    "reflocs_manually.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "INFO\n",
    "\n",
    "For the above query, once again, the 109 yields no results.\n",
    "\n",
    "\n",
    "Next step: lets get time and position of Frankfurt airport and try to find some spatio-temporal intersecting trajectories."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2016-04-01T04:40:00\n",
      "POINT (2.0783333778381348 41.29694366455078)\n"
     ]
    }
   ],
   "source": [
    "time = reguls.iloc[0]['start']     #get the time of EDDF regulation\n",
    "rpoint = reflocs_manually.iloc[0]['o'] #get the coordinates of Frankfurt airport (manually)\n",
    "\n",
    "print(time)\n",
    "print(rpoint)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In the next query, I have to enter the times manually, because (as we have seen) the end time of a regulation is not available in the system. AFAIK, the nodes themselves only have start times, as they only represent a point in time."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "ename": "EndPointInternalError",
     "evalue": "EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed \\nWHERE {\\n    ?s1     a              :Node ;\\n           :ofMovingObject ?vessel ;\\n           :hasSpeed       ?speed ;\\n        dul:hasConstituent/:TimeStart ?time ;\\n        dul:hasConstituent/:hasWKT ?wkt .\\n        \\n    FILTER(bif:st_distance( bif:st_geomfromtext (\\'POINT (2.0783333778381348 41.29694366455078)\\'), bif:st_geomfromtext(?wkt)) <= 5 &&\\n    xsd:dateTime(substr(?time,1,19))>xsd:dateTime(\"2016-04-01 04:40:00\") && \\n    xsd:dateTime(substr(?time,1,19))<xsd:dateTime(\"2016-04-01 06:52:00\"))\\n}\\n'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mHTTPError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    570\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 571\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    572\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    222\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 223\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    224\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    531\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 532\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    533\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    641\u001b[0m             response = self.parent.error(\n\u001b[0;32m--> 642\u001b[0;31m                 'http', request, response, code, msg, hdrs)\n\u001b[0m\u001b[1;32m    643\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    569\u001b[0m             \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'default'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'http_error_default'\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0morig_args\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 570\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    571\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    503\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 504\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    505\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_default\u001b[0;34m(self, req, fp, code, msg, hdrs)\u001b[0m\n\u001b[1;32m    649\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_error_default\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 650\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mHTTPError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    651\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mHTTPError\u001b[0m: HTTP Error 500: SPARQL Request Failed",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m                     Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-28-96c9f257e171>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     19\u001b[0m \"\"\"\n\u001b[1;32m     20\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 21\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqry\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     22\u001b[0m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclean\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     23\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhead\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m20\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/jsnotes/1_datAcron/datacron_connector.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self, query)\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     47\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 48\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     49\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     50\u001b[0m         \u001b[0;31m#clean up the column mess (thanks to David Knodt)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    599\u001b[0m             \u001b[0;34m@\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mL\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;34m}\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    600\u001b[0m         \"\"\"\n\u001b[0;32m--> 601\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    602\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    603\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    577\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointNotFound\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    578\u001b[0m             \u001b[0;32melif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m500\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 579\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointInternalError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    580\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    581\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m: EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed \\nWHERE {\\n    ?s1     a              :Node ;\\n           :ofMovingObject ?vessel ;\\n           :hasSpeed       ?speed ;\\n        dul:hasConstituent/:TimeStart ?time ;\\n        dul:hasConstituent/:hasWKT ?wkt .\\n        \\n    FILTER(bif:st_distance( bif:st_geomfromtext (\\'POINT (2.0783333778381348 41.29694366455078)\\'), bif:st_geomfromtext(?wkt)) <= 5 &&\\n    xsd:dateTime(substr(?time,1,19))>xsd:dateTime(\"2016-04-01 04:40:00\") && \\n    xsd:dateTime(substr(?time,1,19))<xsd:dateTime(\"2016-04-01 06:52:00\"))\\n}\\n'"
     ]
    }
   ],
   "source": [
    "\n",
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?vessel ?time ?wkt ?speed \n",
    "WHERE {\n",
    "    ?s1     a              :Node ;\n",
    "           :ofMovingObject ?vessel ;\n",
    "           :hasSpeed       ?speed ;\n",
    "        dul:hasConstituent/:TimeStart ?time ;\n",
    "        dul:hasConstituent/:hasWKT ?wkt .\n",
    "        \n",
    "    FILTER(bif:st_distance( bif:st_geomfromtext ('\"\"\" + rpoint + \"\"\"'), bif:st_geomfromtext(?wkt)) <= 5 &&\n",
    "    xsd:dateTime(substr(?time,1,19))>xsd:dateTime(\"2016-04-01 04:40:00\") && \n",
    "    xsd:dateTime(substr(?time,1,19))<xsd:dateTime(\"2016-04-01 06:52:00\"))\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEM\n",
    "\n",
    " - According to this query, no trajectory intersects with EDDF.... I think this must be a query problem.\n",
    " - on the 107 store, this transaction times out.\n",
    " \n",
    " \n",
    " \n",
    "Lets go on and check if wx conditions are available in the system."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>w</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [s, w]\n",
       "Index: []"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX sw: <http://sweet.jpl.nasa.gov>\n",
    "\n",
    "SELECT ?s ?w\n",
    "WHERE {\n",
    "    ?s a             :Node ;\n",
    "       :hasWeatherCondition ?w .\n",
    "    \n",
    "    FILTER regex(str(?s), 'm3', \"i\")\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "df.head(5)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "LITTLE PROBLEM\n",
    "\n",
    "Only in the 107 data store, I get results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>traj_AA51136207_20160401082500_m2</td>\n",
       "      <td>affectedBy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>traj_AA51134958_20160401101500_m2</td>\n",
       "      <td>affectedBy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>traj_AA51143112_20160401090500_m2</td>\n",
       "      <td>affectedBy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>traj_AA51142022_20160401064000_m2</td>\n",
       "      <td>affectedBy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>traj_AA51144491_20160401080500_m2</td>\n",
       "      <td>affectedBy</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   s           p\n",
       "0  traj_AA51136207_20160401082500_m2  affectedBy\n",
       "1  traj_AA51134958_20160401101500_m2  affectedBy\n",
       "2  traj_AA51143112_20160401090500_m2  affectedBy\n",
       "3  traj_AA51142022_20160401064000_m2  affectedBy\n",
       "4  traj_AA51144491_20160401080500_m2  affectedBy"
      ]
     },
     "execution_count": 73,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX sw: <http://sweet.jpl.nasa.gov>\n",
    "\n",
    "SELECT ?s ?p \n",
    "WHERE {\n",
    "    ?s ?p :LEBLA01M_411\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "df.head(5)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "      <td>ATC_WeatherRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>hasRegion</td>\n",
       "      <td>Airspace_LEBL_411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>hasTimeInterval</td>\n",
       "      <td>intv_1459490400000_1459515600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>RegulationAiracCycle</td>\n",
       "      <td>411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>RegulationDescription</td>\n",
       "      <td>CB + STORM_</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hasReferenceLocation</td>\n",
       "      <td>Place_Barcelona_El_Prat_Airport</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       p                                 o\n",
       "0                   type             ATC_WeatherRegulation\n",
       "1              hasRegion                 Airspace_LEBL_411\n",
       "2        hasTimeInterval  intv_1459490400000_1459515600000\n",
       "3   RegulationAiracCycle                               411\n",
       "4  RegulationDescription                       CB + STORM_\n",
       "5   hasReferenceLocation   Place_Barcelona_El_Prat_Airport"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = ts109.qry_properties(':LEBLA01M_411', True)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "datacronKernel1",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
