{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Regulation Inspection"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The goal is to be able to forecast regulations, based on raw data like WX conditions or traffic density. \n",
    "\n",
    "My focus is on WX regulations.\n",
    "According to the document \"CRIDA-Regulations-20160401-20160430.csv\", regulations have the following properties:\n",
    "\n",
    "| dateReference | RegulationStart   | RegulationId | TrafficVolumeSet | ReferenceLocation | ReferenceLocationType | TrafficVolume | RegulationEnd     | RegulationActivity | RegulationCancelTime | RegulationDuration | AiracCycle | RegulationCategory | RegulationReasonCode | RegulationDescription | \n",
    "|---------------|-------------------|--------------|------------------|-------------------|-----------------------|---------------|-------------------|--------------------|----------------------|--------------------|------------|--------------------|----------------------|-----------------------| \n",
    "| 20160401      | 20160401 04:40:00 | EDDFA01      | EDGGFMP1         | EDDF              | AD                    | EDDFAWX       | 20160401 07:20:00 | C                  | 20160401 05:52:57    | 72                 | 411        | T                  | W                    | STRONG WINDS          | \n",
    "| 20160401      | 20160401 06:00:00 | LEBLA01M     | LECBFMP          | LEBL              | AD                    | LEBLARR       | 20160401 13:00:00 | C                  | 20160401 11:41:42    | 341                | 411        | T                  | W                    | CB + STORM            | \n",
    "| 20160401      | 20160401 08:40:00 | LECVN01M     | LECBFMP          | LECBCVN           | AS                    | LECBCVN1      | 20160401 11:20:00 | C                  | 20160401 08:16:03    | -23                | 411        | T                  | C                    |                       | \n",
    "\n",
    "\n",
    "\n",
    "Acc. \"DatAcron Data sources for Flow Management scenarios.pptx\", Traffic Volume is the sector name.\n",
    "\n",
    "These are three typical examples for WX-caused regulations. It is important to note the column \"referenceLocation\" which indicates us that the critical weather, that caused the regulation, is not co-located with the regulated sector. Note also the \"referenceLocationType\", which denotes if the area of interest is an airport or an airspace.\n",
    "\n",
    "The second important column is the \"RegulationCancelTime\", which denotes that a regulation may be cancelled if, for example, the actual weather turns out to be better than expected, or the network resilience is good enough to cope with demand exceeding capacity. The third regulation was even cancelled before it begun, yielding a negative \"regulation time\".\n",
    "\n",
    "\n",
    "\n",
    "With the following data exploration, I hope to pull these important properties of the regulation out of the data store. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from pandas.io.json import json_normalize, read_json\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, XML, RDF\n",
    "\n",
    "#import my connection module which allows to connect to the datAcron rdf store\n",
    "from datacron_connector import TripleStoreConnector\n",
    "\n",
    "ts107 = TripleStoreConnector(0)\n",
    "ts109 = TripleStoreConnector(1)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's check what kind of regulations are stored in the triple store."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get all airblocks of spain\n",
    "\n",
    "First, I will get all airblocks, together with their airspaces and super-airspaces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 12 ms, sys: 0 ns, total: 12 ms\n",
      "Wall time: 106 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>bigairspace</th>\n",
       "      <th>airspace</th>\n",
       "      <th>block</th>\n",
       "      <th>wkt</th>\n",
       "      <th>lowerlevel</th>\n",
       "      <th>upperlevel</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEABTA_411</td>\n",
       "      <td>Airblock_LEABTA_249LE</td>\n",
       "      <td>POLYGON ((-2.99166666666667 39, -2.99166666666...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7467.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Airspace_LEABTMA_411</td>\n",
       "      <td>Airspace_LEABTA_411</td>\n",
       "      <td>Airblock_LEABTA_249LE</td>\n",
       "      <td>POLYGON ((-2.99166666666667 39, -2.99166666666...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>7467.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_650LE</td>\n",
       "      <td>POLYGON ((-2.84083333333333 36.4166666666667, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_650LE</td>\n",
       "      <td>POLYGON ((-2.84083333333333 36.4166666666667, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_651LE</td>\n",
       "      <td>POLYGON ((-1.83333333333333 36.85, -1.83333333...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_651LE</td>\n",
       "      <td>POLYGON ((-1.83333333333333 36.85, -1.83333333...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_652LE</td>\n",
       "      <td>POLYGON ((-1.86111111111111 36.7138888888889, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_652LE</td>\n",
       "      <td>POLYGON ((-1.86111111111111 36.7138888888889, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Airspace_LEAMTMA_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_653LE</td>\n",
       "      <td>POLYGON ((-1.92361111111111 36.4530555555556, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Airspace_LETOT_411</td>\n",
       "      <td>Airspace_LEAMTA_411</td>\n",
       "      <td>Airblock_LEAMTA_653LE</td>\n",
       "      <td>POLYGON ((-1.92361111111111 36.4530555555556, ...</td>\n",
       "      <td>0.0</td>\n",
       "      <td>4419.6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            bigairspace             airspace                  block  \\\n",
       "0    Airspace_LETOT_411  Airspace_LEABTA_411  Airblock_LEABTA_249LE   \n",
       "1  Airspace_LEABTMA_411  Airspace_LEABTA_411  Airblock_LEABTA_249LE   \n",
       "2    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_650LE   \n",
       "3  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_650LE   \n",
       "4    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_651LE   \n",
       "5  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_651LE   \n",
       "6    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_652LE   \n",
       "7  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_652LE   \n",
       "9  Airspace_LEAMTMA_411  Airspace_LEAMTA_411  Airblock_LEAMTA_653LE   \n",
       "8    Airspace_LETOT_411  Airspace_LEAMTA_411  Airblock_LEAMTA_653LE   \n",
       "\n",
       "                                                 wkt lowerlevel upperlevel  \n",
       "0  POLYGON ((-2.99166666666667 39, -2.99166666666...        0.0     7467.6  \n",
       "1  POLYGON ((-2.99166666666667 39, -2.99166666666...        0.0     7467.6  \n",
       "2  POLYGON ((-2.84083333333333 36.4166666666667, ...        0.0     4419.6  \n",
       "3  POLYGON ((-2.84083333333333 36.4166666666667, ...        0.0     4419.6  \n",
       "4  POLYGON ((-1.83333333333333 36.85, -1.83333333...        0.0     4419.6  \n",
       "5  POLYGON ((-1.83333333333333 36.85, -1.83333333...        0.0     4419.6  \n",
       "6  POLYGON ((-1.86111111111111 36.7138888888889, ...        0.0     4419.6  \n",
       "7  POLYGON ((-1.86111111111111 36.7138888888889, ...        0.0     4419.6  \n",
       "9  POLYGON ((-1.92361111111111 36.4530555555556, ...        0.0     4419.6  \n",
       "8  POLYGON ((-1.92361111111111 36.4530555555556, ...        0.0     4419.6  "
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX myfn: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT  ?bigairspace ?airspace ?block ?wkt ?lowerlevel ?upperlevel \n",
    "WHERE { \n",
    "   \n",
    "   ?airspace dul:hasPart       ?block .\n",
    "   ?block       :hasLowerLevel ?lowerlevel ;\n",
    "                :hasUpperLevel ?upperlevel ;\n",
    "                :hasGeometry   ?geom.\n",
    "   ?geom        :hasMBR_WKT  ?wkt .\n",
    "   \n",
    "   OPTIONAL {?bigairspace dul:hasPart ?airspace.}.\n",
    "   \n",
    "   FILTER regex(str(?block), 'Airblock_LE', \"i\")\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df2 = ts109.query(qry)\n",
    "df2 = ts109.clean(df2)\n",
    "%time df2 = df2.sort_values('block')\n",
    "\n",
    "df2.to_csv('allspanishairblocks.csv')\n",
    "df2.head(10)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Get all information about the three regulations above\n",
    "\n",
    "First, I will check what kind of regulations are available and then, I will check what information is available on the three regulations from the example in the introduction."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>FM_Regulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ATC_WeatherAlternateRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ATC_SecurityRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ATC_RestrictionWeatherAtDestinationRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ATC_RestrictionStaffShortageRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ATC_RestrictionRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>ATC_RestrictionAtDestinationRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ATC_RestrictionAtDepartureRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ATC_OtherRegulationAtDestination</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ATC_ImmigrationCustomsHealthRegulation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               s\n",
       "0                                  FM_Regulation\n",
       "1                 ATC_WeatherAlternateRegulation\n",
       "2                         ATC_SecurityRegulation\n",
       "3  ATC_RestrictionWeatherAtDestinationRegulation\n",
       "4         ATC_RestrictionStaffShortageRegulation\n",
       "5                      ATC_RestrictionRegulation\n",
       "6         ATC_RestrictionAtDestinationRegulation\n",
       "7           ATC_RestrictionAtDepartureRegulation\n",
       "8               ATC_OtherRegulationAtDestination\n",
       "9         ATC_ImmigrationCustomsHealthRegulation"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?s\n",
    "WHERE {\n",
    "  ?s rdfs:subClassOf* :FM_Regulation .\n",
    "}\n",
    "\"\"\"\n",
    " #?s rdf:type/rdfs:subClassOf* :SpatiotemporalRegion \n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(10)\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What properties are available for the WX regulations? I hope to see some of the columns listed in the introduction."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>RegulationAiracCycle</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>RegulationDescription</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>hasRegion</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>hasParticipant</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>hasTimeInterval</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                       p\n",
       "0                   type\n",
       "1   RegulationAiracCycle\n",
       "2  RegulationDescription\n",
       "3              hasRegion\n",
       "4         hasParticipant\n",
       "5        hasTimeInterval"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT DISTINCT ?p\n",
    "WHERE {\n",
    "  ?s a :ATC_WeatherRegulation ; \n",
    "     ?p ?o .\n",
    "}\n",
    "\"\"\"\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEM\n",
    "\n",
    "It seems that at least the \n",
    "\n",
    " - reference location\n",
    " - reference location type\n",
    " - and the cancellation time \n",
    " \n",
    "are not available. Maybe hidden somewhere? I will inspect further. In the next query, I inspect all properties of the three regulations cited above."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 117,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>stype</th>\n",
       "      <th>sector</th>\n",
       "      <th>time</th>\n",
       "      <th>participant</th>\n",
       "      <th>description</th>\n",
       "      <th>start</th>\n",
       "      <th>end</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>EDDFA01_411</td>\n",
       "      <td>ATC_WeatherRegulation</td>\n",
       "      <td>Sector_EDGGFMP1</td>\n",
       "      <td>intv_1459485600000_1459485600000</td>\n",
       "      <td>ATC_EDDF</td>\n",
       "      <td>STRONG WINDS</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>ATC_WeatherRegulation</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>LECVN01M_411</td>\n",
       "      <td>ATC_Capacity</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459500000000_1459500000000</td>\n",
       "      <td>ATC_LECBCVN</td>\n",
       "      <td></td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              s                  stype           sector  \\\n",
       "0   EDDFA01_411  ATC_WeatherRegulation  Sector_EDGGFMP1   \n",
       "1  LEBLA01M_411  ATC_WeatherRegulation   Sector_LECBFMP   \n",
       "2  LECVN01M_411           ATC_Capacity   Sector_LECBFMP   \n",
       "\n",
       "                               time  participant   description  \\\n",
       "0  intv_1459485600000_1459485600000     ATC_EDDF  STRONG WINDS   \n",
       "1  intv_1459490400000_1459490400000     ATC_LEBL    CB + STORM   \n",
       "2  intv_1459500000000_1459500000000  ATC_LECBCVN                 \n",
       "\n",
       "                 start                  end  \n",
       "0  2016-04-01T04:40:00  2016-04-01T04:40:00  \n",
       "1  2016-04-01T06:00:00  2016-04-01T06:00:00  \n",
       "2  2016-04-01T08:40:00  2016-04-01T08:40:00  "
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?s ?stype ?sector ?time ?participant ?description ?start ?end\n",
    "WHERE {\n",
    "  VALUES ?s {:EDDFA01_411 :LEBLA01M_411 :LECVN01M_411} \n",
    "  ?s    :hasRegion             ?sector ;\n",
    "     dul:hasParticipant        ?participant ;\n",
    "        :RegulationDescription ?description ;\n",
    "     dul:hasTimeInterval       ?time  ;\n",
    "         a                     ?stype.\n",
    "  \n",
    "  ?time :TimeStart ?start ;\n",
    "        :TimeEnd   ?end .      \n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "reguls = ts107.query(qry)\n",
    "reguls = ts107.clean(reguls)\n",
    "reguls.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "RESULT TECHNICAL\n",
    "\n",
    "Unfortunately, neither reference location type nor cancellation time are encoded anywhere. But these would be necessary. The _reference location_ seems to be encoded in the _particpant_ property. Another interesting entity is the Sector_xyz, which I have not seen anwhere else.\n",
    "\n",
    "NOTE\n",
    "\n",
    "The 109 yields no results with the query above.\n",
    "\n",
    "Lets inspect the _participant_ and the _sector_ objects further. It will be important to be able to get their coordinates, because at _particpant_, is the place where the WX regulation was caused. And at _sector_, the coordinates are important to be able to intersect them with the trajectories. \n",
    "\n",
    "The following query asks if the participants are ?subjects or ?objects in any other triple in the data store.\n",
    "The query thereafter asks if the sectors are ?subjects or ?objects in any other triple in the data store.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "              s               p\n",
      "0  LECVN01M_411  hasParticipant\n",
      " \n",
      "Empty DataFrame\n",
      "Columns: [p, o]\n",
      "Index: []\n"
     ]
    }
   ],
   "source": [
    "qry = \"\"\"PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\"\"\"\n",
    "\n",
    "qry1 = qry + ' SELECT ?s ?p WHERE {?s ?p :ATC_LECBCVN }'\n",
    "qry2 = qry + ' SELECT ?p ?o WHERE {:ATC_LECBCVN ?p ?o }'\n",
    "p1 = ts107.clean(ts107.query(qry1))\n",
    "p2 = ts107.clean(ts107.query(qry2))\n",
    "\n",
    "print(p1)\n",
    "print(' ')\n",
    "print(p2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "              s                              type          p\n",
      "0  LECVN01M_411                      ATC_Capacity  hasRegion\n",
      "1  LEBLA03A_411   ATC_AerodromeCapacityRegulation  hasRegion\n",
      "2  LEMNI103_411                      ATC_Capacity  hasRegion\n",
      "3  LEBLA03L_411  ATC_EnvironmentalIssueRegulation  hasRegion\n",
      "4  LEBP1U04_411                      ATC_Capacity  hasRegion\n",
      " \n",
      "Empty DataFrame\n",
      "Columns: [p, o]\n",
      "Index: []\n"
     ]
    }
   ],
   "source": [
    "\n",
    "\n",
    "qry = \"\"\"PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\"\"\"\n",
    "\n",
    "qry1 = qry + \"\"\" SELECT ?s ?type ?p \n",
    "                 WHERE {?s ?p :Sector_LECBFMP;\n",
    "                           a ?type .\n",
    "                 }\"\"\"\n",
    "\n",
    "qry2 = qry + ' SELECT ?p ?o WHERE {:Sector_LECBFMP ?p ?o }'\n",
    "p1 = ts107.clean(ts107.query(qry1))\n",
    "p2 = ts107.clean(ts107.query(qry2))\n",
    "p1.to_csv('data/sectorrefs.csv')\n",
    "print(p1.head(5))\n",
    "print(' ')\n",
    "print(p2)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Conclusion: except for the regulation triples, no information about the _participant_ objects and the _sector_ Objects is available (tried with all three). Maybe something wrong with the query?\n",
    "\n",
    "\n",
    "WHAT IS OK\n",
    "\n",
    "It seems like the \"referenceLocation\" is coded as \"hasParticipant\". So, while I do not 100% agree if \"hasParticipant\" is the correct property for real-life semantics, at least the data is there.\n",
    "\n",
    "\n",
    "PROBLEMS\n",
    "\n",
    "As we can see, some data that was available in the raw data is missing.\n",
    " - start and end times are the same, what went wrong?\n",
    " - is the \"hasParticipant\" property really the reference location?\n",
    " - if yes, unfortunately, as seen in the query above, \"participant\" seems like a dead end. Except for appearing in the context of a regulation, there are no other triples. I would have expected to get a link to an airport (if ref loc is AD type) or to an airspace (if ref loc is an airspace). In this case, I would have expected to get the link to the airports LEBL and EDDF. Please note also, that the system has added ATC\\_ in front of the reference location. In my eyes, this changes semantics, because it does not consider the \"reference location type\", which can be an airspace _or_ an aerodrome. And, just to remember, the EDDF and the LEBL example regulations were _aerodrome_ regulations.\n",
    " - the notion of Sector_xyz seems to be unknown for the rest of the database. This also looks like I am hitting a dead end, because I can therefore not link the regulations to airblocks (and their coordinates).\n",
    "\n",
    "Somehow, I need to get from regulations to airblocks.\n",
    "\n",
    "Maybe something wrong with my queries?\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Another fun thing\n",
    "\n",
    "The query below explodes if I try to add the subquery for the times. Then, I get incoherent results (multiple times for the same regulation ID, negative durations ...) Maybe a bug in the processing of the data?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>sector</th>\n",
       "      <th>time</th>\n",
       "      <th>participant</th>\n",
       "      <th>description</th>\n",
       "      <th>start</th>\n",
       "      <th>end</th>\n",
       "      <th>duration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>EDDFA01_411</td>\n",
       "      <td>Sector_EDGGFMP1</td>\n",
       "      <td>intv_1459485600000_1459485600000</td>\n",
       "      <td>ATC_EDDF</td>\n",
       "      <td>STRONG WINDS</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "      <td>2016-04-01T04:40:00</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>-50</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>44</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>341</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>-35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>LEBLA01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459490400000_1459490400000</td>\n",
       "      <td>ATC_LEBL</td>\n",
       "      <td>CB + STORM</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>2016-04-01T06:00:00</td>\n",
       "      <td>99</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>LECVN01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459500000000_1459500000000</td>\n",
       "      <td>ATC_LECBCVN</td>\n",
       "      <td></td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>LECVN01M_411</td>\n",
       "      <td>Sector_LECBFMP</td>\n",
       "      <td>intv_1459500000000_1459500000000</td>\n",
       "      <td>ATC_LECBCVN</td>\n",
       "      <td></td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>2016-04-01T08:40:00</td>\n",
       "      <td>-23</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               s           sector                              time  \\\n",
       "0    EDDFA01_411  Sector_EDGGFMP1  intv_1459485600000_1459485600000   \n",
       "1   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "2   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "3   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "4   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "5   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "6   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "7   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "8   LEBLA01M_411   Sector_LECBFMP  intv_1459490400000_1459490400000   \n",
       "9   LECVN01M_411   Sector_LECBFMP  intv_1459500000000_1459500000000   \n",
       "10  LECVN01M_411   Sector_LECBFMP  intv_1459500000000_1459500000000   \n",
       "\n",
       "    participant   description                start                  end  \\\n",
       "0      ATC_EDDF  STRONG WINDS  2016-04-01T04:40:00  2016-04-01T04:40:00   \n",
       "1      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "2      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "3      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "4      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "5      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "6      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "7      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "8      ATC_LEBL    CB + STORM  2016-04-01T06:00:00  2016-04-01T06:00:00   \n",
       "9   ATC_LECBCVN                2016-04-01T08:40:00  2016-04-01T08:40:00   \n",
       "10  ATC_LECBCVN                2016-04-01T08:40:00  2016-04-01T08:40:00   \n",
       "\n",
       "   duration  \n",
       "0        72  \n",
       "1       -50  \n",
       "2        44  \n",
       "3       341  \n",
       "4       -35  \n",
       "5        80  \n",
       "6       870  \n",
       "7        36  \n",
       "8        99  \n",
       "9        80  \n",
       "10      -23  "
      ]
     },
     "execution_count": 134,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT ?s ?sector ?time ?participant ?description ?start ?end ?duration\n",
    "WHERE {\n",
    "  VALUES ?s {:EDDFA01_411 :LEBLA01M_411 :LECVN01M_411 } \n",
    "  ?s    :hasRegion             ?sector ;\n",
    "     dul:hasParticipant        ?participant ;\n",
    "        :RegulationDescription ?description ;\n",
    "     dul:hasTimeInterval       ?time .\n",
    "   \n",
    "   ?time :TimeStart ?start ;\n",
    "        :TimeEnd   ?end ; \n",
    "        :duration ?duration .\n",
    "\n",
    "        \n",
    "}\n",
    "\"\"\" \n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Weather Analysis (related to page 5 of tutorial) \n",
    "\n",
    "I think I will need some help here too!\n",
    "\n",
    "Though we have seen that Sectors and Participants cannot be linked with other objects, I can infer from the semantics of the regulations that the airports EDDF and LEBL and the airspace LECB must have had severe wx at that time. \n",
    "\n",
    "Lets try to pull it out.\n",
    "\n",
    "To my knowledge, the wx is written to the nodes, so I need to find the trajectories which have a spatio-temporal intersection with the wx event at the sector. For this, I begin with the basic intersection query from the tutorial, page 5."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 144,
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "ename": "EndPointInternalError",
     "evalue": "EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed  \\nWHERE {\\n?s1   a :Node ;\\n        :ofMovingObject ?vessel ;\\n        :hasSpeed ?speed ;\\n     dul:hasConstituent/:TimeStart ?time ;\\n     dul:hasConstituent/:hasWKT ?wkt .\\n\\nFILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\\n}\\n'",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mHTTPError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    570\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 571\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0murlopener\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mrequest\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    572\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreturnFormat\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36murlopen\u001b[0;34m(url, data, timeout, cafile, capath, cadefault, context)\u001b[0m\n\u001b[1;32m    222\u001b[0m         \u001b[0mopener\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0m_opener\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 223\u001b[0;31m     \u001b[0;32mreturn\u001b[0m \u001b[0mopener\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mopen\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0murl\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mdata\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mtimeout\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    224\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mopen\u001b[0;34m(self, fullurl, data, timeout)\u001b[0m\n\u001b[1;32m    531\u001b[0m             \u001b[0mmeth\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mprocessor\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 532\u001b[0;31m             \u001b[0mresponse\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmeth\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mresponse\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    533\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_response\u001b[0;34m(self, request, response)\u001b[0m\n\u001b[1;32m    641\u001b[0m             response = self.parent.error(\n\u001b[0;32m--> 642\u001b[0;31m                 'http', request, response, code, msg, hdrs)\n\u001b[0m\u001b[1;32m    643\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36merror\u001b[0;34m(self, proto, *args)\u001b[0m\n\u001b[1;32m    569\u001b[0m             \u001b[0margs\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mdict\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'default'\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m'http_error_default'\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;34m+\u001b[0m \u001b[0morig_args\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 570\u001b[0;31m             \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_call_chain\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    571\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36m_call_chain\u001b[0;34m(self, chain, kind, meth_name, *args)\u001b[0m\n\u001b[1;32m    503\u001b[0m             \u001b[0mfunc\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mgetattr\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mhandler\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmeth_name\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 504\u001b[0;31m             \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mfunc\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m*\u001b[0m\u001b[0margs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    505\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mresult\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mnot\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/urllib/request.py\u001b[0m in \u001b[0;36mhttp_error_default\u001b[0;34m(self, req, fp, code, msg, hdrs)\u001b[0m\n\u001b[1;32m    649\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mhttp_error_default\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mreq\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 650\u001b[0;31m         \u001b[0;32mraise\u001b[0m \u001b[0mHTTPError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mreq\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfull_url\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mcode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mmsg\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhdrs\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfp\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    651\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mHTTPError\u001b[0m: HTTP Error 500: SPARQL Request Failed",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m                     Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-144-4faba6723360>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m     18\u001b[0m \"\"\"\n\u001b[1;32m     19\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 20\u001b[0;31m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mqry\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     21\u001b[0m \u001b[0mdf\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mts107\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mclean\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mdf\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     22\u001b[0m \u001b[0mdf\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mhead\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;36m20\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/jsnotes/1_datAcron/datacron_connector.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self, query)\u001b[0m\n\u001b[1;32m     46\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     47\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 48\u001b[0;31m         \u001b[0mresult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msparql\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mconvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     49\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     50\u001b[0m         \u001b[0;31m#clean up the column mess (thanks to David Knodt)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36mquery\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    599\u001b[0m             \u001b[0;34m@\u001b[0m\u001b[0mrtype\u001b[0m\u001b[0;34m:\u001b[0m \u001b[0mL\u001b[0m\u001b[0;34m{\u001b[0m\u001b[0mQueryResult\u001b[0m\u001b[0;34m}\u001b[0m \u001b[0minstance\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    600\u001b[0m         \"\"\"\n\u001b[0;32m--> 601\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mQueryResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_query\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    602\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    603\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mqueryAndConvert\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/joerg/anaconda3/envs/datacron1/lib/python3.6/site-packages/SPARQLWrapper/Wrapper.py\u001b[0m in \u001b[0;36m_query\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    577\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointNotFound\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    578\u001b[0m             \u001b[0;32melif\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mcode\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m500\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 579\u001b[0;31m                 \u001b[0;32mraise\u001b[0m \u001b[0mEndPointInternalError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0me\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mread\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    580\u001b[0m             \u001b[0;32melse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    581\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0me\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mEndPointInternalError\u001b[0m: EndPointInternalError: endpoint returned code 500 and response. \n\nResponse:\nb'Virtuoso S1T00 Error SR171: Transaction timed out\\n\\nSPARQL query:\\ndefine sql:big-data-const 0 \\n#output-format:application/sparql-results+json\\n\\nPREFIX : <http://www.datacron-project.eu/datAcron#>\\nPREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\n\\nSELECT ?vessel ?time ?wkt ?speed  \\nWHERE {\\n?s1   a :Node ;\\n        :ofMovingObject ?vessel ;\\n        :hasSpeed ?speed ;\\n     dul:hasConstituent/:TimeStart ?time ;\\n     dul:hasConstituent/:hasWKT ?wkt .\\n\\nFILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\\n}\\n'"
     ]
    }
   ],
   "source": [
    "# PREFIX bif: <java:datAcronTester.unipi.gr.sparql_functions.>   <--- only to be used in 109\n",
    "\n",
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?vessel ?time ?wkt ?speed  \n",
    "WHERE {\n",
    "?s1   a :Node ;\n",
    "        :ofMovingObject ?vessel ;\n",
    "        :hasSpeed ?speed ;\n",
    "     dul:hasConstituent/:TimeStart ?time ;\n",
    "     dul:hasConstituent/:hasWKT ?wkt .\n",
    "\n",
    "FILTER(bif:st_distance(bif:st_geomfromtext (\"POINT(13.139045 44.466133)\"),bif:st_geomfromtext(?wkt))<=5)\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEMS\n",
    " - I get a timeout on the 107 store\n",
    " - I get zero results on the 109 store\n",
    " - note: on the 107 store, the bif: prefix must not be used, on the 109 store, it must be used. Therefore, you cannot query both stores with the same string atm.\n",
    " \n",
    " \n",
    "Back to EDDF and LEBL and LECB. Our goal is to get some weather for these places at regulation time. \n",
    "\n",
    "As a first step, we get the geometries of the _reference locations_."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>airport</th>\n",
       "      <th>iata</th>\n",
       "      <th>placename</th>\n",
       "      <th>geo</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>LEBL</td>\n",
       "      <td>BCN</td>\n",
       "      <td>BARCELONA/EL PRAT</td>\n",
       "      <td>geom_2_0783333778381348_41_29694366455078</td>\n",
       "      <td>POINT (2.0783333778381348 41.29694366455078)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>EDDF</td>\n",
       "      <td>FRA</td>\n",
       "      <td>FRANKFURT MAIN</td>\n",
       "      <td>geom_8_570555686950684_50_03333282470703</td>\n",
       "      <td>POINT (8.570555686950684 50.03333282470703)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  airport iata          placename                                        geo  \\\n",
       "0    LEBL  BCN  BARCELONA/EL PRAT  geom_2_0783333778381348_41_29694366455078   \n",
       "1    EDDF  FRA     FRANKFURT MAIN   geom_8_570555686950684_50_03333282470703   \n",
       "\n",
       "                                              o  \n",
       "0  POINT (2.0783333778381348 41.29694366455078)  \n",
       "1   POINT (8.570555686950684 50.03333282470703)  "
      ]
     },
     "execution_count": 137,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "\n",
    "SELECT DISTINCT ?airport ?iata ?placename ?geo ?o\n",
    "WHERE {\n",
    "  VALUES ?airport {'EDDF' 'LEBL' 'LECB'}\n",
    "  ?s :hasICAOcode ?airport ;\n",
    "     :hasIATAcode ?iata ;\n",
    "     :hasPlaceName ?placename ;\n",
    "     :hasGeometry ?geo .\n",
    "  ?geo :hasMBR_WKT ?o .\n",
    "     \n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "reflocs_manually = ts107.query(qry)\n",
    "reflocs_manually = ts107.clean(reflocs_manually)\n",
    "reflocs_manually.head(20)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "INFO\n",
    "\n",
    "For the above query, once again, the 109 yields no results.\n",
    "\n",
    "\n",
    "Next step: lets get time and position of Frankfurt airport and try to find some spatio-temporal intersecting trajectories."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 139,
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2016-04-01T04:40:00\n",
      "POINT (2.0783333778381348 41.29694366455078)\n"
     ]
    }
   ],
   "source": [
    "time = reguls.iloc[0]['start']     #get the time of EDDF regulation\n",
    "rpoint = reflocs_manually.iloc[0]['o'] #get the coordinates of Frankfurt airport (manually)\n",
    "\n",
    "print(time)\n",
    "print(rpoint)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "In the next query, I have to enter the times manually, because (as we have seen) the end time of a regulation is not available in the system. AFAIK, the nodes themselves only have start times, as they only represent a point in time."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 145,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>vessel</th>\n",
       "      <th>time</th>\n",
       "      <th>wkt</th>\n",
       "      <th>speed</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [vessel, time, wkt, speed]\n",
       "Index: []"
      ]
     },
     "execution_count": 145,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX bif: <java:datAcronTester.unipi.gr.sparql_functions.>\n",
    "\n",
    "SELECT ?vessel ?time ?wkt ?speed \n",
    "WHERE {\n",
    "    ?s1     a              :Node ;\n",
    "           :ofMovingObject ?vessel ;\n",
    "           :hasSpeed       ?speed ;\n",
    "        dul:hasConstituent/:TimeStart ?time ;\n",
    "        dul:hasConstituent/:hasWKT ?wkt .\n",
    "        \n",
    "    FILTER(bif:st_distance( bif:st_geomfromtext ('\"\"\" + rpoint + \"\"\"'), bif:st_geomfromtext(?wkt)) <= 500 &&\n",
    "    xsd:dateTime(substr(?time,1,19))<xsd:dateTime(\"2016-04-01 04:40:00\") && \n",
    "    xsd:dateTime(substr(?time,1,19))>xsd:dateTime(\"2016-04-01 06:52:00\"))\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts109.query(qry)\n",
    "df = ts109.clean(df)\n",
    "df.head(20)\n",
    "\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PROBLEM\n",
    "\n",
    " - According to this query, no trajectory intersects with EDDF.... I think this must be a query problem.\n",
    " \n",
    " \n",
    " \n",
    "Lets go on and check if wx conditions are available in the system."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s</th>\n",
       "      <th>w</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>node_0_1453961518000_15.896575_43.7204233333333</td>\n",
       "      <td>weather_43.7204233333333_15.896575_0.0_1453971600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>node_100000001_1453961006000_3.05081333333333_...</td>\n",
       "      <td>weather_36.7109833333333_3.05081333333333_0.0_...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>node_104938_1453961970000_2.35546_51.042906666...</td>\n",
       "      <td>weather_51.0429066666667_2.35546_0.0_1453971600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>node_10772765_1453961146000_4.71531666666667_5...</td>\n",
       "      <td>weather_51.828_4.71531666666667_0.0_1453971600</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>node_10772765_1453961746000_4.71518833333333_5...</td>\n",
       "      <td>weather_51.8279616666667_4.71518833333333_0.0_...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                   s  \\\n",
       "0    node_0_1453961518000_15.896575_43.7204233333333   \n",
       "1  node_100000001_1453961006000_3.05081333333333_...   \n",
       "2  node_104938_1453961970000_2.35546_51.042906666...   \n",
       "3  node_10772765_1453961146000_4.71531666666667_5...   \n",
       "4  node_10772765_1453961746000_4.71518833333333_5...   \n",
       "\n",
       "                                                   w  \n",
       "0  weather_43.7204233333333_15.896575_0.0_1453971600  \n",
       "1  weather_36.7109833333333_3.05081333333333_0.0_...  \n",
       "2    weather_51.0429066666667_2.35546_0.0_1453971600  \n",
       "3     weather_51.828_4.71531666666667_0.0_1453971600  \n",
       "4  weather_51.8279616666667_4.71518833333333_0.0_...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX sw: <http://sweet.jpl.nasa.gov>\n",
    "\n",
    "SELECT ?s ?w\n",
    "WHERE {\n",
    "    ?s     :hasWeatherCondition ?w .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(5)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "LITTLE PROBLEM\n",
    "\n",
    "Only in the 107 data store, I get results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>o</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>type</td>\n",
       "      <td>WeatherCondition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>reportedDewPoint</td>\n",
       "      <td>14.859985</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>reportedMaxTemperature</td>\n",
       "      <td>14.799988</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>reportedMinTemperature</td>\n",
       "      <td>14.799988</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>reportedPressure</td>\n",
       "      <td>101688.46</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                        p                 o\n",
       "0                    type  WeatherCondition\n",
       "1        reportedDewPoint         14.859985\n",
       "2  reportedMaxTemperature         14.799988\n",
       "3  reportedMinTemperature         14.799988\n",
       "4        reportedPressure         101688.46"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qry = \"\"\"\n",
    "PREFIX : <http://www.datacron-project.eu/datAcron#>\n",
    "PREFIX dul: <http://www.ontologydesignpatterns.org/ont/dul/DUL.owl#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX sw: <http://sweet.jpl.nasa.gov>\n",
    "\n",
    "SELECT ?p ?o\n",
    "WHERE {\n",
    "   :weather_43.7204233333333_15.896575_0.0_1453971600   ?p ?o\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "df = ts107.query(qry)\n",
    "df = ts107.clean(df)\n",
    "df.head(5)\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "datacron1",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
